> `revision` needs to be set `computed`?

Yes.

Given how I now understand the limitations of revision (it must start with `<service name>-`), if it isn't, the API returns the error `"The revision name must be prefixed by the name of the enclosing Service with a trailing -"` it makes the most sense that only the suffix can be specified (as it does [with the CLI](https://cloud.google.com/sdk/gcloud/reference/run/services/update#--revision-suffix))

<details><summary>Show output</summary>

```
$ terraform apply

data.google_project.project: Reading...
data.google_project.project: Read complete after 2s [id=projects/my-example-proj]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "northamerica-northeast2"
      + name                    = "revision-cant-be-ignored"
      + observed_generation     = (known after apply)
      + project                 = "my-example-proj"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + revision                         = "version-1"
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "gcr.io/cloudrun/hello"

              + env {
                  + name  = "FOO"
                  + value = "bar"
                }
              + env {
                  + name  = "mickey"
                  + value = "mouse"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_cloud_run_v2_service.default: Creating...
╷
│ Error: Error creating Service: googleapi: Error 400: template.revision: The revision name must be prefixed by the name of the enclosing Service with a trailing -
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.BadRequest",
│     "fieldViolations": [
│       {
│         "description": "The revision name must be prefixed by the name of the enclosing Service with a trailing -",
│         "field": "template.revision"
│       }
│     ]
│   }
│ ]
│
│   with google_cloud_run_v2_service.default,
│   on main.tf line 9, in resource "google_cloud_run_v2_service" "default":
│    9: resource "google_cloud_run_v2_service" "default" {
│
╵
```
</details>